"use strict";
// Не забывайте пользоваться switch и тернарным оператором

// Задания:
// Если переменная a равна нулю, то выведите ‘Верно’, иначе выведите ‘Неверно’.
// Если переменная a больше нуля, то выведите ‘Верно’, иначе выведите ‘Неверно’.
//  Если переменная a меньше нуля, то выведите ‘Верно’, иначе выведите ‘Неверно’.
//  Если переменная a больше или равна нулю, то выведите ‘Верно’, иначе выведите ‘Неверно’.
//  Если переменная a меньше или равна нулю, то выведите ‘Верно’, иначе выведите ‘Неверно’.
//  Если переменная a не равна нулю, то выведите ‘Верно’, иначе выведите ‘Неверно’.
//  Если переменная a равна ‘test’, то выведите ‘Верно’, иначе выведите ‘Неверно’.
//  Если переменная a равна ‘1’ и по значению и по типу, то выведите ‘Верно’, иначе выведите ‘Неверно’.
//  Если переменная a больше нуля и меньше 5-ти, то выведите ‘Верно’, иначе выведите ‘Неверно’.
//  Если переменная a равна нулю или равна двум, то прибавьте к ней 7, иначе поделите ее на 10. Выведите новое значение переменной на экран.
//  Если переменная a равна или меньше 1, а переменная b больше или равна 3, то выведите сумму этих переменных, иначе выведите их разность (результат вычитания).
//  Если переменная a больше 2-х и меньше 11-ти, или переменная b больше или равна 6-ти и меньше 14-ти, то выведите ‘Верно’, в противном случае выведите ‘Неверно’.
//  Переменная num может принимать 4 значения: 1, 2, 3 или 4. Если она имеет значение ‘1’, то в переменную result запишем ‘зима’, если имеет значение ‘2’ – ‘весна’ и так далее. Решите задачу через switch-case.

// let a = prompt('Введите значение переменной "a"');
// let b = prompt('Введите значение переменной "b"'); 
+a === 0 ? console.log('Верно') : console.log('Не верно');
console.log(typeof a); 
+a > 0 ? console.log('Верно') : console.log('Не верно'); 
+a < 0 ? console.log('Верно') : console.log('Не верно'); 
+a >= 0 ? console.log('Верно') : console.log('Не верно'); 
+a <= 0 ? console.log('Верно') : console.log('Не верно'); 
+a !== 0 ? console.log('Верно') : console.log('Не верно');
a === 'test' ? console.log('Верно') : console.log('Не верно');
a === '1' ? console.log('Верно') : console.log('Не верно');
a > 0 && a < 5 ? console.log('Верно') : console.log('Не верно'); 
+a === 0 || +a === 2 ? a = +a + 7 : a /= 10, console.log(a); 
+a <= 1 && +b >= 3 ? console.log(+a + (+b)) : console.log(a - b); 
+a > 2 && +a < 11 || +b >= 6 && b < 14 ? console.log('Верно') : console.log('Не верно');

let num= prompt('введите значение от 1 до 4');
let result=null;

switch(num){
    case '1':
        result='Зима'
        break;
    case '2':
        result='Весна';
        break;
    case '3':
        result='Лето';
        break;
    case '4':
        result='Осень';
        break;
    default:
        break;

}

console.log(result);